/***********************************************************************************
;Company : Yspring ------深圳市汇春科技股份有限公司
;File Name :10F273
;Description :  MDT10F273_WDT_AWAKEN_范例程序
;程序功能说明：
;			MCU接5V供电，PA5接LED快闪2s（循环）
;			进入睡眠，睡眠时LED灭。	
;			睡眠时打开WDT，WDT定时4.2s从睡眠唤醒。
;			MCU睡眠功耗1.2uA
************************************************************************************/

#include "mdt10F273.h"	
#include "273cfg.h"

//------------------------------------数据类型重定义--------------------------------

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned long u32;

//------------------------------------函数声明--------------------------------------

void Init_Timer0_WDT(void); //初始化timer0和WDT
void Init_Timer1(void);     //初始化timer1
void Init_Timer2(void);     //初始化timer2
void Init_GPIO(void);       //初始化IO
void Init_INT(void);        //初始化INT

//-------------------------------------宏定义--------------------------------------

#define	T2S		20          //2s = 20 * 100ms

//--------------------------------------变量定义----------------------------------

u8 Timer_100ms_ctr;         //100ms计数器

//------------------------------------位变量定义----------------------------------

bit  flag_t2 = 0;           //100ms中断标志

/*********************************************************************************
;
;函数名: main 
;
;函数说明:	主函数入口
;
********************************************************************************/
void main(void)         
{
	CLRWDT();                   //清看门狗

	SET_HIRC(IRCF_4M);          //内部振荡器频率选择4MHz

	Init_Timer0_WDT();          //初始化timer0和WDT
	Init_Timer1();              //初始化timer1
	Init_Timer2();              //初始化timer2
	Init_GPIO();                //初始化IO
	Init_INT();                 //初始化INT

//====================================主循环=====================================
	while(1)
	{
		CLRWDT();               //清除 看门狗 

		if(flag_t2 == 1)        //100ms判断
		{
			flag_t2 = 0;        //100ms标志清零
			
			PORTA ^= 0x20;		//Timer2 定时100ms中断溢出	PA5 取反输出
		
			Timer_100ms_ctr ++ ;//100ms计数器
			if(Timer_100ms_ctr >= T2S)         //2s判断
			{
				Timer_100ms_ctr = 0x00;        //计数器清0
				//272睡眠 漏电注意事项:  	MCU 上电默认选择外部参考输入脚(PC1/VREF) 作为AD参考电压，睡眠前需改成内部参考，否则会有漏电。
				//	当使用默认的外部参考时，PC1设置为数字输出口，输出高，睡眠时会有45uA 的漏电流存在。
				ADS0 =0x00;	//如果选择外部参考则需要进入睡眠前切换为内部参考，否则会有漏电流
				PORTA = 0x00;           //PA口 全输出"L"
				PORTC = 0x00;           //PC口 全输出"L"
				
				SET_HIRC(IRCF_500K);//睡眠之前 系统时钟 切换到	500KHz 或小于 500KHz（不可大于500KHz）--------（这里将Fosc设置为500KHz）
				CLRWDT();
				asm("nop");             //切换“系统时钟”后，需加至少两个以上的NOP指令，等待时钟稳定
				asm("nop");
				asm("nop");
				
				SLEEP();                //MCU 睡眠
				
				CLRWDT();				//MCU唤醒后 需做 清除WDT操作
				
										//当MCU供电电压“低于4.5V”时，不可使用16MHz作为“系统时钟 ”
				SET_HIRC(IRCF_4M);			//唤醒后，“系统时钟”切换到所需“时钟频率”--------（这里将Fosc设置为4MHz）
				asm("nop"); 			//切换“系统时钟”后，需加至少两个以上的NOP指令，等待时钟稳定
				asm("nop");
				asm("nop");
			
				PORTA ^= 0x20;          //Timer2 定时100ms中断溢出	PA5 取反输出

				
			}
		}
			
	}
}


/*********************************************************************************
;
;函数名: ISR 
;
;函数说明:	中断服务程序
;
*********************************************************************************/
void interrupt ISR(void)		//PICC 编译 中断函数定义
{
	
	if(TIF == 1)                //TMR0中断判断
	{
		TIF = 0;                //T0 带自动重载功能 不需要重置初始值
	}
	
	if(TMR1IF == 1)             //timer1中断判断
	{
		TMR1IF = 0;             //timer1中断标志清0
	}
	
	if(TMR2IF == 1)             //timer2中断判断
	{
		TMR2IF = 0;             //timer2中断标志清0
		
		TMR2ON = 0;             //T2需重置初始值
		TMR2H = 0x3c;           //15536 = 65536 - 50000	(0x3cb0 = 15536)
		TMR2L = 0xb0;           //100ms = 50000 * 2us
		TMR2ON = 1;             //使能timer2定时器
		
		flag_t2 = 1;            //100ms标志置1
	}
	
}


/**********************************************************************************
;
;函数名: Init_GPIO

;函数说明:	初始化IO口
;
**********************************************************************************/

void Init_GPIO(void)
{
	ADINA = 0x00;	//PA模拟/数字IO设置 		1:模拟功能		0:数字I/O功能
	ADINC = 0x00;	//PC模拟/数字IO设置 		1:模拟功能		0:数字I/O功能
	
	CPIOA = 0b00000000;	//PA口输入输出控制		1:输入		0:输出
	CPIOC = 0b00000000;	//PC口输入输出控制		1:输入		0:输出
	
	PAPHR = 0x00;	//PA弱上拉控制位			1:使能		0:禁止
	PAPDR = 0x00;	//PA弱下拉控制位			1:使能		0:禁止
	
	PCPHR = 0x00;	//PC弱上拉控制位			1:使能		0:禁止
	PCPDR = 0x00;	//PC弱下拉控制位			1:使能		0:禁止
		
	PAINTR = 0x00;	//PA电平变化中断允许位		1:使能		0:禁止
	
	PORTA = 0x00;	//PA全输出"L"
	PORTC = 0x00;	//PC全输出"L"
}


/********************************************************************************
;
;函数名: Init_Timer0_WDT

;函数说明:	初始化Timer0、WDT
;
********************************************************************************/

void Init_Timer0_WDT(void)
{
//	TCS = 0;            //TMR0时钟源选择位		1:PA2/T0CKI引脚上信号的跳变		0:内部指令周期时钟（ Fosc/4）
//	TMR0 = 6;           //
//	TMR0EN = 0;         //Tiemr0 启动/停止位	1:启动Timer0		0:停止Timer0

	WDTPSDIV_2();       //8位预分频器分配给WDT，预分频比选择1:2	
	WDTDIV_65536();     //16位预分频器，预分频比选择 1:65536	-->		4.228s =  1 / ( ( 31000 / 65536 )  / 2 )
	SWDTEN = 1;         //使能WDT（仅在OPTION中 disable WDT时有效）	
}


/*******************************************************************************
;
;函数名: Init_Timer1

;函数说明:	初始化Timer1
;
*******************************************************************************/
void Init_Timer1(void)
{
	
}


/*******************************************************************************
;
;函数名: Init_Timer2

;函数说明:	初始化Timer2
;
*******************************************************************************/
void Init_Timer2(void)
{
	
	T2SELEN = 0;	//Timer2 时钟源选择位					0: Timer2 时钟源由TMR2CS位确定
//	T2SELEN = 1;	//Timer2 时钟源选择位					1: Timer2 时钟源由 T2FOSC位确定

	T2FOSC = 0; //Timer2 时钟源选择内部快时钟使能位 		0: Timer2 时钟源选择内部 " 慢时钟 " 	(当 T2SELEN = 1时)
//	T2FOSC = 1; //Timer2 时钟源选择内部快时钟使能位 	1: Timer2 时钟源选择内部 " 快时钟 " (当 T2SELEN = 1时)
		

	T2GINV = 0;		//Timer2门控翻转位					0: Timer2门控为低电平有效（门控为低电平时Timer2计数）
//	T2GINV = 1;		//Timer2门控翻转位				1: Timer2门控为高电平有效（门控为高电平时Timer2计数）

	TMR2GE = 0;		//Timer2门控使能位					0: Timer2打开
//	TMR2GE = 1;		//Timer2门控使能位				1: Timer2在Timer2门控不活动时打开

	T2PSDIV_8();	//Timer2输入时钟预分频比选择1:8	( Fosc = 4MHz  __ T = 2us)

	T2SYNC = 0;		//Timer2外部时钟输入同步控制位		0: 同步外部时钟输入
//	T2SYNC = 1;		//Timer2外部时钟输入同步控制位		1: 不同步外部时钟输入

	TMR2CS = 0;		//Timer2时钟源选择位			0: 内部时钟（SYS_CLK）
//	TMR2CS = 1;		//Timer2时钟源选择位			1: 来自T12CK1引脚（上升沿）的外部时钟

	T2OSCEN = 0;	//LP振荡器使能控制位			0:  LP振荡器关闭
//	T2OSCEN = 1;	//LP振荡器使能控制位			1:  LP振荡器被使能用于Timer2时钟	

	
	TMR2H = 0x3c;	//15536 = 65536 - 50000	(0x3cb0 = 15536)
	TMR2L = 0xb0;	//100ms = 50000 * 2us
	
	TMR2ON = 1;		//Timer2启动/停止位		1: 启动 Timer2		0: 停止Timer2
}


/*******************************************************************
;
;函数名: Init_INT

;函数说明:	初始化 中断
;
********************************************************************/

void Init_INT(void)
{
	INTS = 0x00;	//中断相关寄存器 清零
	PIFB0 = 0x00;	//中断相关寄存器 清零
	PIFB1 = 0x00;	//中断相关寄存器 清零
	
	TMR2IF = 0;     //timer2中断标志清零
	TMR2IE = 1;		//使能  T2中断		用到 T2中断 需同时使能 T2中断、外设中断、总中断 
	
	PEIE = 1;		//使能  外设中断
	GIE = 1;		//使能  总中断
}

//*******************************************************************




