/***********************************************************************************
;Company : Yspring ------深圳市汇春科技股份有限公司
;File Name :10F273
;Description :  MDT10F273_AD_范例程序
;功能说明：采集AN2通道的AD值，当电压大于2.02V时使PA4输出高电平；
                              当电压小于2V时使PA4输出低电平。
***********************************************************************************/

#include "mdt10F273.h"
#include "273cfg.h"

//-----------------------------------数据类型重定义--------------------------------

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned long u32;

//------------------------------------函数声明-------------------------------------

void Init_Timer0_WDT(void); //timer0和WDT初始化函数
void Init_Timer1(void);     //timer1初始化函数
void Init_Timer2(void);     //timer2初始化函数
void Init_GPIO(void);       //IO初始化函数
void Init_INT(void);        //中断初始化函数
void Init_ADC(void);        //AD初始化函数
void delay(unsigned char i);//软件延时函数

u16 Get_ADC_Result(u8 CHx ,u8 REFx);//AD转换函数

//------------------------------------宏定义--------------------------------------


//-----------------------------------变量定义-------------------------------------
u16 adc_res;                //ADC采样结果缓存变量
u16 adc_vss;
u16 adc_temp;               //ADC采样缓存变量量
//-----------------------------------位定义---------------------------------------
bit flag_t0=0;              //标志位定义

/*********************************************************************************
;函数名: main 
;函数说明:	主函数入口
*********************************************************************************/
void main(void)         
{
	CLRWDT();          //清看门狗

	SET_HIRC(IRCF_4M); //内部振荡器频率选择4MHz

	Init_GPIO();       //IO初始化

	Init_Timer0_WDT(); //初始化定时器
//	Init_Timer1();
//	Init_Timer2();

	Init_INT();        //初始化中断

	Init_ADC();        //初始化ADC
	
//========================主循环==================
	while(1)
	{
		CLRWDT();	             //清除 看门狗 
			
		if(flag_t0 == 1)         //2ms标志判断
		{
			flag_t0 = 0;         //2ms标志清0
			
			adc_temp = Get_ADC_Result(ANCHSEL_AN2,VREFSEL_2048MV) - Get_ADC_Result(ANCHSEL_VSS,VREFSEL_2048MV);

			if(adc_temp >= 2020)		//AD 口电压高于1.01V	输出 高
				PA4 = 1;                //PA4输出高电平
			else if(adc_temp < 2000)	//AD 口电压低于1V	    输出 低
				PA4 = 0;                //PA4输出低电平
		}	
	}
}

/**************************************************************************************************
;函数名: Get_ADC_Result
;
;函数说明: 获取AD采样结果，12位AD结果(0~4095)
;				
;入口参数:  选择通道 CHx ,选择参考电压 REFx
;
;返回值: 	adc_res
;
***************************************************************************************************/
u16 Get_ADC_Result(u8 CHx ,u8 REFx)
{
	u8 i = 0;                   //定义临时变量
	u16 temp =0,adsum=0;        //定义临时变量

	ADS0 = 0;     
	
	ADS0 = ADS0 | CHx | REFx;	//模拟通道选择

	ADC_EN = 1;			        //启动 AD模块 		
	
	delay(50);			        //延时200us		//改变参考电压或者 启动AD模块  需延时200us以上

	adsum =0;                   //寄存器清0	
	
	for(i=0;i<8;i++)
	{
		BUSY = 1;			 //启动AD 开始转换
		while(BUSY);		 //等待AD 转换完成  
		temp = ADRESH;	     //(0000 xxxx)读取12位AD 结果高字节寄存器(高4位为0，低4 位值有效)   //AD结果右对齐	
		temp <<= 8;		     //(0000 xxxx 0000 0000)
		temp += ADRESL;	     //(0000 xxxx xxxx xxxx)读取12位AD 结果低字节寄存器的值，存放在adc_res 中
		
		adsum+=temp;         //求和
	}

	adsum >>=3;              //左移3位求平均

	ADC_EN = 0;				 //关闭AD模块 省电
	
	return(adsum);           //返回AD结果值
}
/*******************************************************************
;
;函数名: Init_ADC

;函数说明:	初始化AD
;
********************************************************************/
void Init_ADC(void)
{
	ADC0CN = 0;
	ADCHSET_PA2AN2();	//AD通道设置

	ADFM = 1;			//AD结果 右对齐，高位补零
	ADSCKDIV_16();		//AD时钟预分频选择
	ADSTASEL_BUZY();	//AD启动转换模式选择


	//注意: 上电初始化 或者睡眠唤醒后，需关闭AD模块 再 启动 ，防止某些特殊应用导致AD模块异常
	ADC_EN = 0;			//关闭 AD模块
}

/*******************************************************************
;
;函数名: delay 
;
;函数说明:	延时子程序
;
********************************************************************/

void delay(unsigned char i)
{
	while(i--);
}	

/*******************************************************************
;
;函数名: ISR 
;
;函数说明:	中断服务程序
;
********************************************************************/
void interrupt ISR(void)		//PICC 编译 中断函数定义
{
	
	if(TIF == 1)        //tmr0中断 
	{
		TIF = 0;		//T0 带自动重载功能 不需要重置初始值
		
		PORTC ^= 0x01;	//Timer0 定时 2ms中断溢出	PC0 取反输出
		flag_t0 = 1;    //置2ms标志
	}
	
}

/*******************************************************************
;
;函数名: Init_GPIO

;函数说明:	初始化IO口
;
********************************************************************/

void Init_GPIO(void)
{
	ADINA = 0x00;	//PA模拟/数字IO设置 		1:模拟功能		0:数字I/O功能
	ADINC = 0x00;	//PC模拟/数字IO设置 		1:模拟功能		0:数字I/O功能

	CPIOA = 0b00001000;	//PA口输入输出控制		1:输入		0:输出
	CPIOC = 0b00000000;	//PC口输入输出控制		1:输入		0:输出
	
	PAPHR = 0x00;	//PA弱上拉控制位			1:使能		0:禁止
	PAPDR = 0x00;	//PA弱下拉控制位			1:使能		0:禁止
	
	PCPHR = 0x00;	//PC弱上拉控制位			1:使能		0:禁止
	PCPDR = 0x00;	//PC弱下拉控制位			1:使能		0:禁止
		
	PAINTR = 0x00;	//PA电平变化中断允许位		1:使能		0:禁止
	
	PORTA = 0x00;	//PA全输出"L"
	PORTC = 0x00;	//PC全输出"L"
	
}

/*******************************************************************
;
;函数名: Init_Timer0_WDT

;函数说明:	初始化Timer0、WDT
;
********************************************************************/

void Init_Timer0_WDT(void)
{
	TCS = 0;		//TMR0时钟源选择位		1:PA2/T0CKI引脚上信号的跳变		0:内部指令周期时钟（ Fosc/4）
	T0PSDIV_8();	//Timer0预分频比选择1:8	单步8us	(Fosc = 4MHz)  (Fcpu = Fosc/4 = 1MHz)
	TMR0 = 6;		//250 = 256 - 6		2ms = 250 * 8us	
	TMR0EN = 1;		//Tiemr0 启动/停止位	1:启动Timer0		0:停止Timer0
	
//	WDTDIV_512();
	WDTDIV_32768(); //设置看门狗定时器
	SWDTEN = 1;		//使能看门狗	
}

/*******************************************************************
;
;函数名: Init_Timer1

;函数说明:	初始化Timer1
;
********************************************************************/
void Init_Timer1(void)
{
	

}


/*******************************************************************
;
;函数名: Init_Timer2

;函数说明:	初始化Timer2
;
********************************************************************/
void Init_Timer2(void)
{

}


/*******************************************************************
;
;函数名: Init_INT

;函数说明:	初始化 中断
;
********************************************************************/

void Init_INT(void)
{
	INTS = 0x00;    //中断相关寄存器 清零
	
	TIF = 0;        //tmr0中断标志清0
	TIS = 1;        //使能 T0中断
	
	GIE = 1;        //使能  总中断

}

//*******************************************************************




